[
 {
  "heroCode": "Sven_DOTA",
  "heroName": "Sven",
  "heroTitle": "Rogue Knight",
  "heroGender": "MALE",
  "game": "Dota 2",
  "imgIcon": "dota-sven.png",
  "heroDescription": "Melee initiator\/carry with overwhelming strength. Excels at disabling enemies from range and following up with empowered cleave strikes.",
  "heroLore": "Sven is the son of a human Vigil Knight and a Pallid Meranth woman, a union forbidden by both of their peoples. After his father was executed for violating the Vigil Codex, Sven and his mother were cast out living together in the Shadeshore Ruins. After his mother passed away, he came to believe that true honor must come from within, not from institutions. He later trained in secret under the very order that had condemned his family, hiding his identity while mastering their ways. On the day he was meant to be inducted into their ranks, Sven rejected the Vigil Knights. Instead, he seized the Outcast Blade, destroyed the Sacred Helm, and burned the Codex that once judged him. Though he walks alone, Sven lives by a strict personal code — a knight not of any order, but of his own making.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Pantheon_LOL",
  "heroName": "Pantheon",
  "heroTitle": "Unbreakable Spear",
  "heroGender": "MALE",
  "game": "League of Legends",
  "imgIcon": "lol-pantheon.png",
  "heroDescription": "Melee diver with high burst damage. Leaps into combat from any distance and overwhelms isolated targets.",
  "heroLore": "Once chosen as the mortal vessel for the celestial Aspect of War, Atreus was caught between the will of the divine and the limits of his humanity. When the Aspect was struck down, Atreus somehow survived — not through cosmic power, but through sheer mortal resolve. Though no longer a god, he rose again, wielding the relics of the fallen Pantheon as a symbol of defiance. Now, Atreus fights not as an instrument of the heavens, but as a man who stood against them — his indomitable will driving every strike.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Amaterasu_SMITE",
  "heroName": "Amaterasu",
  "heroTitle": "Shining Light",
  "heroGender": "FEMALE",
  "game": "Smite",
  "imgIcon": "sm-amaterasu.png",
  "heroDescription": "Melee warrior who leads allies with auras. Weakens enemies and returns damage with empowered strikes.",
  "heroLore": "Amaterasu, the revered Sun Goddess and highest deity of the Japanese pantheon, once withdrew from the world in sorrow after her brother Susano vandalized her sacred spaces. Her retreat into the cave Ama-no-Iwato plunged the land into darkness, leaving its people to suffer without sunlight. It was only through the joyous dance of the Goddess Ame-no-Uzume and a glimpse of her own reflection in a bronze mirror that Amaterasu was lured out, restoring light to the world. Moved by the devotion of those who depended on her, she vowed to never again turn away, taking up arms to confront any force that threatened her people — even the war among the gods themselves.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Xul_HOTS",
  "heroName": "Xul",
  "heroTitle": "Cryptic Necromancer",
  "heroGender": "MALE",
  "game": "Heroes of the Storm",
  "imgIcon": "hots-xul.png",
  "heroDescription": "Melee bruiser who summons undead to overwhelm foes. Weakens enemies with curses and damage-over-time effects.",
  "heroLore": "Xul, a necromancer of the secretive Rathma sect, is devoted to maintaining the Balance between light and darkness. When chaos followed in the wake of the Dark Wanderer, Xul joined a band of heroes who pursued the source of corruption across Sanctuary — from the Rogue Monastery to Harrogath — aiding the archangel Tyrael and confronting demonic forces that threatened humanity. Together, they overcame the Prime Evils and several of their lesser kin, culminating in the destruction of the Worldstone. After the battle ended, Xul returned to his order, passing on his knowledge to a new generation of necromancers, including his apprentice Mehtan, ensuring that the Balance would be preserved long after his time.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Shangguan_HOK",
  "heroName": "Shangguan",
  "heroTitle": "Calligrapher",
  "heroGender": "FEMALE",
  "game": "Honor of Kings",
  "alternativeName": "Shangguan Wan'er",
  "imgIcon": "hok-shangguan.png",
  "heroDescription": "Ranged mage who wields magical ink to devastate enemies. Chaining abilities grants mobility and great spell damage.",
  "heroLore": "Born into a family disgraced by political betrayal, Shangguan was only four when her grandfather — a respected calligrapher and former official — was executed under false charges of treason by scheming royals, leading to her family’s enslavement. Despite her grim circumstances and haunting nightmares of murderous flowers, she remained steadfast in her studies and thirst for justice. Under the mentorship of a painter, she rose to become a trusted agent of Empress Wu Zetian, aiding in the investigation of the supposed coup. Her efforts uncovered the officials responsible for her family’s downfall, and she exposed them with the help of Detective Di Renjie. Yet one figure, the enigmatic ‘Peony Diviner’ Ming, escaped punishment — prompting Shangguan to pursue deeper truths that lead her to the Great Wall, determined to confront the shadows of her past.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Lauriel_AOV",
  "heroName": "Lauriel",
  "heroTitle": "Archangel",
  "heroGender": "FEMALE",
  "game": "Arena of Valor",
  "imgIcon": "aov-lauriel.png",
  "heroDescription": "Ranged mage\/assassin who smites enemies with holy light. Slippery and deadly, she thrives on reduced cooldowns to sustain high burst damage.",
  "heroLore": "Lauriel, a compassionate archangel of Veda, was one of its earliest demigods and a former disciple of Edras before his assassination by Volkath. After Ilumia assumed leadership, Lauriel became head of the Hall of Gospel, overseeing prayers and guiding believers, while also being named Ilumia’s potential successor. Unlike the distant Ilumia, Lauriel is deeply empathetic toward humanity, believing in their potential and striving to protect them. Sharing only a common concern over the rising threat of Lokheim, Lauriel leads Veda’s angelic host in battle, wielding the divine powers of light and reincarnation to stand against the dark forces.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Alucard_MLBB",
  "heroName": "Alucard",
  "heroTitle": "Demon Hunter",
  "heroGender": "MALE",
  "game": "Mobile Legends Bang Bang",
  "imgIcon": "mlbb-alucard.png",
  "heroDescription": "Melee fighter who excels at chasing down targets. Shreds defenses and strikes hard while sustaining through lifesteal.",
  "heroLore": "Alucard, son of Moniyan Imperial Guard Captain Roland, lost his father in a demon assault that left the man falsely branded as disobedient. Determined to clear his father's name, Alucard trained under Tigreal at the Monastery of Light, growing into a skilled demon hunter. During a later mission, his right arm was corrupted by demonic power, and a surviving witness revealed the truth: Roland had made a selfless stand after corrupt knights caused their unit’s entrapment, allowing Tigreal's forces to escape. When Alucard confronted the Monastery and petitioned the Empire to acknowledge the truth, he was rejected and declared a heretic due to his corrupted arm. Disillusioned, he abandoned the Monastery to hunt demons on his own terms, gaining renown across the Land of Dawn — still seeking vengeance and hoping his father might have survived.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Takiyasha-hime_OA",
  "heroName": "Takiyasha-hime",
  "heroGender": "FEMALE",
  "game": "Onmyoji Arena",
  "imgIcon": "oa-takiyasha-hime.png",
  "heroDescription": "Melee samurai with powerful close-range attacks. Commands spectral steeds with diverse effects to control and devastate the battlefield.",
  "heroLore": "Once known as Yōhime, she was the devoted daughter of a general and loyal protector of Queen Himiko. Gifted with the Moon Stone—an artifact that mirrored Himiko’s Solar Stone—Yōhime was blessed with immunity to the time-altering effects of grief-fueled magic. When a devastating plague claimed the lives of Himiko’s people and husband, the queen descended into madness and unknowingly trapped the land in a time loop. Yōhime’s father died that same day, and she was forced to relive the tragedy again and again, her memory untouched by the resets. After countless cycles of sorrow, Yōhime embraced the full power of the Moon Stone, shed her old identity, and became Takiyasha-hime. Now, burdened yet resolute, she seeks to break the loop and release Himiko—and herself—from eternal suffering.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Artesia_HON",
  "heroName": "Artesia",
  "heroGender": "FEMALE",
  "game": "Heroes of Newerth",
  "imgIcon": "hon-artesia.png",
  "heroDescription": "Ranged hybrid mage who toggles between offense and support. Bombards foes or heals allies with homing wisps and bolts while sustaining pressure with a spectral projection.",
  "heroLore": "Artesia was once part of a pair of powerful sorcerers, united not just by their magic, but by an unbreakable bond of love. But fate was cruel—death claimed her beloved, leaving her to wander the world alone, her heart torn between memory and mourning. Though his soul now lingers beyond mortal reach, Artesia still feels his presence like a shadow clinging to her soul. Haunted yet driven, she delves ever deeper into forbidden magic, determined to defy even the gates of the underworld if it means she can see him once more.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Lina_DOTA",
  "heroName": "Lina",
  "heroTitle": "Slayer",
  "heroGender": "FEMALE",
  "game": "Dota 2",
  "imgIcon": "dota-lina.png",
  "heroDescription": "Ranged nuker\/carry with high burst damage and fiery attacks. Excels at melting single targets and stunning enemies in an area with precise skillshots.",
  "heroLore": "Lina is the elder sister of Rylai, the Crystal Maiden, and their childhood was marked by chaotic rivalries—Lina’s fiery temper clashing constantly with Rylai’s icy innocence. Their elemental quarrels were so destructive that their family homes were repeatedly reduced to ash or frostbitten ruins. Eventually, their weary parents decided to separate them, sending Lina south to live with her aunt in the searing Desert of Misrule—a land perfectly suited for her growing fire magic. There, Lina quickly earned fame, though her bold attitude and scorching aura left more than a few admirers singed. Confident, cunning, and ablaze with power, Lina is a firebrand in every sense—unmatched and uncontainable.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Ashe_LOL",
  "heroName": "Ashe",
  "heroTitle": "Frost Archer",
  "heroGender": "FEMALE",
  "game": "League of Legends",
  "imgIcon": "lol-ashe.png",
  "heroDescription": "Ranged marksman who slows and controls enemies with icy arrows. Excels at sustained damage, scouting from afar, and delivering map-wide stuns.",
  "heroLore": "Ashe is the Iceborn warmother of the Avarosan tribe, leading the largest horde in the Freljord. Reserved yet determined, she carries the heavy burden of leadership with quiet resolve, despite her own doubts. Channeling the ancient magic of her bloodline, she wields a bow carved from True Ice—a weapon of legend. Many of her people believe she is the reincarnation of Avarosa, a mythical hero from their past, and Ashe strives to live up to that legacy. Driven by hope rather than conquest, she seeks to unite the fractured tribes of the Freljord and restore peace to a land long torn by war and ancient rivalries.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "GuanYu_SMITE",
  "heroName": "Guan Yu",
  "heroTitle": "Saint of War",
  "heroGender": "MALE",
  "game": "Smite",
  "imgIcon": "sm-guanyu.png",
  "heroDescription": "Melee warrior who sustains himself and allies with healing. Reduces cooldowns through aggressive dashes and excels at prolonged combat—especially when mounted for high-impact chases.",
  "heroLore": "Once a mortal warrior of the Three Kingdoms era, Guan Yu swore brotherhood to Liu Bei and Zhang Fei in the Peach Garden, vowing to build a just world. As a general of Shu, he earned fame for his skill and honor, even temporarily surrendering to Cao Cao only to rejoin Liu Bei when the chance arose. Though he later spared Cao Cao at Red Cliffs out of gratitude, his pride led to his downfall at the hands of Sun Quan. After death, his spirit protected the oppressed, earning devotion from the people. With their prayers, Guan Yu ascended as a god—now a divine guardian of justice, a protector of the innocent, and a saint of war who leads righteous armies against evil.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Valeera_HOTS",
  "heroName": "Valeera",
  "heroTitle": "Shadow of the Uncrowned",
  "heroGender": "FEMALE",
  "game": "Heroes of the Storm",
  "imgIcon": "hots-valeera.png",
  "heroDescription": "Melee assassin who strikes from stealth to disable enemies. Chains abilities into lethal combos to burst down isolated targets.",
  "heroLore": "Orphaned by bandits, Valeera Sanguinar survived through thievery until her fierce spirit caught the eye of Rehgar Earthfury, who trained her as a gladiator alongside Broll Bearmantle and an amnesiac human—Varian Wrynn, the missing king of Stormwind. The trio forged a deep bond, eventually escaping their captivity, restoring Varian to his throne, and purging Onyxia’s corruption. Later, Valeera joined The Uncrowned, working in the shadows against hidden threats. After the fall of the Burning Legion and Anduin’s rise, she returned as his covert adviser. Though fiercely proud of her blood elf lineage, she aligns with neither Horde nor Alliance, walking her own path.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Kaizer_HOK",
  "heroName": "Kaizer",
  "heroTitle": "Devourer",
  "heroGender": "MALE",
  "game": "Honor of Kings",
  "alternativeName": "Kai, Cain",
  "imgIcon": "hok-kaizer.png",
  "heroDescription": "Melee warrior who excels in chasing down and outlasting foes. Sustains himself through combat and can enter an empowered state to boost offense and defense.",
  "heroLore": "Once a noble of Navenia, Kaizer bore a dark curse born from his family's misdeeds—a demonic armor and an uncontrollable bloodlust that threatened both his life and that of his sister, Luna. Choosing to face the burden alone, he fled in search of a cure. Though he uncovered the roots of the curse, it remained, and Kaizer eventually collapsed near the Great Wall, having lost his memories but retaining his combat instincts. Found by the Wall’s commander, Mulan, he was given a new name—Kai—and a new purpose. Now, he wields his fearsome power not to destroy, but to defend humanity’s last line of resistance.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Kaine_AOV",
  "heroName": "Kaine",
  "heroTitle": "Bloody Punisher",
  "heroGender": "MALE",
  "game": "Arena of Valor",
  "imgIcon": "aov-kaine.png",
  "heroDescription": "Melee assassin who slips into enemy lines to ambush isolated targets. Unleashes his full skillset for devastating burst damage that can swiftly eliminate foes.",
  "heroLore": "Born a half-demon in Ramboat, Kaine spent his early days with his brother figure, Stuart, until a fateful accident saw him adopted into a noble house in Kazell, becoming cousin to Sinestrea. Both shared the rare power to control blood and trained together—until Stuart returned one night, gleefully slaughtering Kaine’s new family for their half-demon lineage. Though Sinestrea survived, Kaine, consumed by rage, wounded Stuart and fled. He was later taken in by the demon hunter Richter, who taught him that power's morality lies in its use. Now, Kaine channels his blood magic as a ruthless warrior who protects the weak and relentlessly hunts his fallen brother.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Guinevere_MLBB",
  "heroName": "Guinevere",
  "heroTitle": "Ms. Violet",
  "heroGender": "FEMALE",
  "game": "Mobile Legends Bang Bang",
  "imgIcon": "mlbb-guinevere.png",
  "heroDescription": "Melee fighter who enchants her attacks with magic for deceptive ranged and melee strikes. Excels at locking enemies airborne while dishing out sustained burst damage.",
  "heroLore": "The youngest daughter of the Baroque family and sister to Lancelot, Guinevere showed little interest in her family's fencing tradition, instead discovering a natural talent for magic. Enrolled in the Magic Academy at a young age, she quickly became a prodigy, mastering anti-gravity magic and honing her mental perception—often testing her spells on a begrudging but affectionate Lancelot. As the Baroque family faced financial ruin, her father arranged a marriage with House Paxley, known for their magical lineage. Unwilling to surrender her freedom, Guinevere chose to escape and search for her brother, hoping he could help her forge her own path.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "Inugami_OA",
  "heroName": "Inugami",
  "heroGender": "MALE",
  "game": "Onmyoji Arena",
  "imgIcon": "oa-inugami.png",
  "heroDescription": "Melee samurai who excels at chasing and locking down foes with empowered strikes. Deals increased damage to the strongest enemy and can enter a heightened state to amplify his attacks and pursuit.",
  "heroLore": "Once a ruthless yōkai driven only by violence, Inugami wandered alone through life, his blade his only companion. Haunted by the destruction he left behind—villages burned, spirits slain—he became estranged from others, believing himself unworthy of peace. But everything changed when a small sparrow perched on his shoulder in the aftermath of a brutal battle. That gentle moment, so unlike his bloodstained path, awakened something long buried within him. Touched by the fragile creature’s trust, Inugami found clarity: his strength was not meant to destroy, but to protect. Now, guided by that one precious friend and the vow he swore on his blade, Inugami walks the battlefield once more—not as a killer, but as a guardian.",
  "displayByTitle": "N"
 },
 {
  "heroCode": "CrystalMaiden_DOTA",
  "heroName": "Rylai",
  "heroTitle": "Crystal Maiden",
  "heroGender": "FEMALE",
  "game": "Dota 2",
  "imgIcon": "dota-crystalmaiden.png",
  "heroDescription": "Ranged support\/nuker who controls enemies with freezing magic to empower allies. Can blanket the battlefield in a deadly blizzard that deals heavy area damage over time.",
  "heroLore": "Rylai, the younger sister of Lina, was born with uncontrollable ice magic that froze everything around her, leading to chaos in her homeland. To avoid further mishaps, she was sent north to the frozen realm of Icewrack, where an ancient Ice Wizard took her in as his apprentice. Under his guidance at the Blueheart Glacier, Rylai learned to master her powers until her teacher finally entered a deep slumber, passing on his legacy. Now known as the Crystal Maiden, Rylai hones her frost magic alone, her abilities having become as beautiful as they are formidable.",
  "displayByTitle": "Y"
 }
]